package com.company;

//ЗАДАНИЕ
//        Текущая программа состоит из следующих классов:
//        Test– точка входа в приложение, именно здесь мы будем работать с нашим
//        функционалом.
//        MathUtil– Util-класс в котором реализованы методы для выполнения арифметических
//        последовательностей и других операций с циклами
//
//        3 Реализовать методы математических последовательностей (факториал ||
//        геометрическая прогрессия || арифметическая прогрессия)
//        Проверить выполнение методов в главном классе, с несколькими наборами
//        параметров.


public class Test {

    public static void main(String[] args) {
	// write your code here
        MathUtil.setFacktorial();

        MathUtil.setGeometry();

        MathUtil.setArifmethik();
    }
}
